minmos/terrasense/newFirmware/sdkconfig.defaults
# --- Partition Table Settings ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Flash Size (4MB) ---
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# --- System Time Logging ---
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM=y

# --- Target Chip ---
CONFIG_IDF_TARGET="esp32c6"